УТ.РасширениеКонтурЛогистика/src/Enums/КонтурЛогистика_ВариантыПодачиКонтейнера/КонтурЛогистика_ВариантыПодачиКонтейнера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_ВариантыПодачиКонтейнера</name>
  <enumValues>
    <name>НетКонтейнера</name>
  </enumValues>
  <enumValues>
    <name>ПриемКПеревозкеГруженогоКонтейнера</name>
  </enumValues>
  <enumValues>
    <name>ПодачаПорожнегоКонтейнераГрузоотправителю</name>
  </enumValues>
</mdclass:Enum>

УТ.РасширениеКонтурЛогистика/src/Enums/КонтурЛогистика_ВариантыПодачиКонтейнера/ManagerModule.bsl
Функция ЗначениеДляXDTO(Ссылка) Экспорт

	Если Ссылка = НетКонтейнера Тогда 
		Результат = Неопределено;
	ИначеЕсли Ссылка = ПриемКПеревозкеГруженогоКонтейнера Тогда 
		Результат = "0";
	ИначеЕсли Ссылка= ПодачаПорожнегоКонтейнераГрузоотправителю Тогда 
		Результат = "1";
	Иначе
		
		ВызватьИсключение "Для заполнения в xml передано неверное значение метода определения ВариантыПодачиКонтейнера: " + Ссылка;
	
	КонецЕсли;
	
	Возврат Результат;

КонецФункции 

Функция ЗначениеИзXDTO(Строка, ЭтоТитул1 = Истина) Экспорт
	
	Результат = ПустаяСсылка();
	
	Если Строка = Неопределено Тогда 
		Результат = ПустаяСсылка();
	ИначеЕсли Строка = "0" Тогда 
		Результат = ПриемКПеревозкеГруженогоКонтейнера;
	ИначеЕсли Строка= "1" Тогда 
		Результат = ПодачаПорожнегоКонтейнераГрузоотправителю;
	Иначе
		
		ИмяСобытия = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИмяСобытияЖурналаРегистрации();
		ТекстОшибки = "Для Титула 1 в xml передано неверное значение метода определения ВариантыПодачиКонтейнера: " + Строка;
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
